In [13]:
import pandas as pd
from scipy.stats import ttest_ind

df_students_experimental = pd.read_excel('Tobias.xlsx', sheet_name='Experimental')
df_students_controle = pd.read_excel('Tobias.xlsx', sheet_name='Controle')

In [14]:
#view first five rows of DataFrame
df_students_experimental.head()

      Alunos  1ª Coleta 12/09 2ª Coleta 13/09 3ª Coleta 14/09     Média
0  1º Aluno                 1               1               1  1.000000
1   2º Aluno                1               1               2  1.333333
2   3º Aluno                3               3               3  3.000000
3   4º Aluno                2               3               3  2.666667
4   5º Aluno                2               2               3  2.333333

In [15]:
df_students_controle.head()

     Alunos 1ª Coleta 12/09 2ª Coleta 13/09 3ª Coleta 14/09     Média
0  1º Aluno               2               3               4  3.000000
1  2º Aluno               1               2               2  1.666667
2  3º Aluno               2               3               3  2.666667
3  4º Aluno               1               3               5  3.000000
4  5º Aluno               1               1               1  1.000000

In [16]:
# perform independent two sample t-test
ttest_ind(df_students_controle['Média'], df_students_experimental['Média'], equal_var=False)

Ttest_indResult(statistic=-0.26033502385845453, pvalue=0.7965127787367792)